tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "danvergara/tools"
tap "derailed/k9s"
tap "eugene1g/safehouse"
tap "peak/tap"
tap "railwaycat/emacsmacport"
tap "zalando-build/taps"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library (client only — psql, pg_dump, pg_restore)
brew "libpq"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# System monitoring app
cask "istat-menus"
# Modern shell for the GitHub era
brew "nushell"
# Screen measuring tool
cask "pixelsnap"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# XML command-line utilities
brew "xmlstarlet"
# Yet Another Dotfiles Manager
brew "yadm"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@30"
# macOS sandbox wrapper for coding agents
brew "eugene1g/safehouse/agent-safehouse"
# Parallel S3 and local filesystem execution tool
brew "peak/tap/s5cmd"
# Zalando AWS CLI (work)
brew "zalando-build/taps/zalando-aws-cli"
# Chromium based browser
cask "arc"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Code snippet organiser
cask "cacher"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Screen capturing tool
cask "cleanshot"
# Google Cloud CLI
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Voice to text app
cask "voiceink"
# Rust-based terminal
cask "warp"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome@canary"
# Dedicated scratchpad for developers
cask "heynote"
# Web browser
cask "firefox"
cask "font-inconsolata-g-for-powerline"
cask "font-input"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
# Replacement for Docker Desktop
cask "orbstack"
# HTTP debugging proxy
cask "proxyman"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# Web browser
cask "safari-technology-preview"
# Native GUI tool for relational databases
cask "tableplus"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
# Multiplayer code editor
cask "zed"
