tap "buo/cask-upgrade"
tap "cavaliercoder/dmidecode"
tap "d12frosted/emacs-plus"
tap "danvergara/tools"
tap "derailed/k9s"
tap "harelba/q"
tap "hashicorp/tap"
tap "jnsahaj/lumen"
tap "macos-fuse-t/cask"
tap "olleolleolle/adr-tools"
tap "peak/tap"
tap "railwaycat/emacsmacport"
tap "raine/claude-history"
# Run your GitHub Actions locally
brew "act"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# SQL-like query language for csv
brew "csvq"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Fast and Lightweight Logs and Metrics processor
brew "fluent-bit"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Command-line downloader for image-hosting site galleries and collections
brew "gallery-dl"
# GNU compiler collection
brew "gcc"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# TUI Git client inspired by Magit
brew "gitu"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Tool to download photos from iCloud
brew "icloudpd"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Feature-rich interactive Jira CLI
brew "jira-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Cross-platform TUI database management tool
brew "lazysql"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# CLI tool for saving complete web pages as a single HTML file
brew "monolith"
# NCurses Disk Usage
brew "ncdu"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Modern shell for the GitHub era
brew "nushell"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Tool to interact with the Phrase API
brew "phrase-cli"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql@13"
# Object-relational database system
brew "postgresql@16"
# Modern API client that lives in your terminal
brew "posting"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# Data wrangler with jq-like query language
brew "sq"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# TCP/IP packet demultiplexer
brew "tcpflow"
# General purpose fuzzy finder TUI
brew "television"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# XML command-line utilities
brew "xmlstarlet"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Yet Another Dotfiles Manager
brew "yadm"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@30"
# Interactive client for PostgreSQL and MySQL
brew "danvergara/tools/dblab"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
# lumen is a command-line tool that can show pretty diff, generate commit messages with AI, summarise diffs / commits, and more without requiring an API key.
brew "jnsahaj/lumen/lumen"
# A command-line tool for working with Architecture Decision Records (ADRs).
brew "olleolleolle/adr-tools/adr_tools"
# Parallel S3 and local filesystem execution tool
brew "peak/tap/s5cmd"
# Fuzzy-search Claude Code conversation history from the terminal
brew "raine/claude-history/claude-history"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Chromium based browser
cask "arc"
# Multi-cloud backup application
cask "arq"
# Multi-track audio editor and recorder
cask "audacity"
# Prevents your sleeping computer from connecting to Bluetooth accessories
cask "bluesnooze"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Code snippet organiser
cask "cacher"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Screen capturing tool
cask "cleanshot"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Native document editor
cask "craft"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-inconsolata-g-for-powerline"
cask "font-input"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
# Kext-less implementation of FUSE
cask "fuse-t"
# SSHFS implementation based on FUSE-T
cask "macos-fuse-t/cask/fuse-t-sshfs"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome@canary"
# Open-source video transcoder
cask "handbrake-app"
# Automated organisation
cask "hazel"
# Chromium-based web browser
cask "helium-browser"
# Dedicated scratchpad for developers
cask "heynote"
# Free and open-source media player
cask "iina"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# System monitoring app
cask "istat-menus"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source Dropbox client
cask "maestral"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Native app email client for Gmail
cask "mimestream"
# Minimal installer for conda
cask "miniconda"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Set of tools to create, alter and inspect Matroska files (MKV)
cask "mkvtoolnix-app"
# Calculator and converter application
cask "numi"
# Replacement for Docker Desktop
cask "orbstack"
# Screen measuring tool
cask "pixelsnap"
# Home media player
cask "plex"
# Music player focusing on visuals
cask "plexamp"
# HTTP debugging proxy
cask "proxyman"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# JavaScript playground that auto-evaluates as code is typed
cask "runjs"
# Web browser
cask "safari-technology-preview"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Search and click text anywhere on screen
cask "superkey"
# Native GUI tool for relational databases
cask "tableplus"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Lossless audio decoder
cask "xld"
# Photo viewer, image manager, image resiser and more
cask "xnviewmp"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alextreichler.hurl"
vscode "anthropic.claude-code"
vscode "be5invis.toml"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "blakeh.jump-to-test"
vscode "bodil.file-browser"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "buenon.scratchpads"
vscode "charliermarsh.ruff"
vscode "ckolkman.vscode-postgres"
vscode "ctenbrinke.vscode-tsv"
vscode "davidsanders.search-under-cursor"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "endormi.2077-theme"
vscode "enkia.enki-vscode-theme"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "fabiospampinato.vscode-open-in-github"
vscode "fallenwood.viml"
vscode "github.codespaces"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "jacobdufault.fuzzy-search"
vscode "jakebecker.elixir-ls"
vscode "janisdd.vscode-edit-csv"
vscode "jasonnutter.search-node-modules"
vscode "jellydn.vscode-hurl-runner"
vscode "jock.svg"
vscode "kahole.magit"
vscode "katjanakosic.vscode-json5"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mkhl.shfmt"
vscode "mohammadbaqer.better-folding"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "oven.bun-vscode"
vscode "primalmotion.primal"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "samuel-pordeus.elixir-test"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "silofy.hackthebox"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "usernamehw.errorlens"
vscode "vincent-ledu.adr-tools"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vsls-contrib.gistfs"
vscode "vsls-contrib.gitdoc"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "waderyan.gitblame"
vscode "wengerk.highlight-bad-chars"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
go "cmd/go"
go "cmd/gofmt"
go "github.com/sammcj/gollama"
go "github.com/carlsverre/kosho"
go "github.com/rwejlgaard/org/cmd/org"
cargo "rainfrog"
